This directory contains the R code used to generate the simulation results
presented in the article: "Design and analysis of group sequential trials for
repeated measurements when pipeline data
occurs: a tutorial". It is organized as follows:
- *the BATCH files* define the simulation studies for a single interim
  and two interim. Each file was excecuted using 18 different
  parameters (missing, binding, constraint on ck, accrual rate, effect
  size) 200 times. Each time corresponds to a different id (obtain
  using =Sys.getenv("SGE_TASK_ID")= in R) and therefore a different
  seed when randomly generating the data. The output of the
  simulations were saved in a =Results= directory, not uploaded on
  Github to save space but available upon request.
- *the FCT file* called by the BATCH file.
- *the FIGURE files* generate addition graphical displayed not shown
  in the article (except =FIGURE-illustration-trial.R= which is shown
  in one of the illustration boxes)
- *the TABLE file* generate tables containing the simulation results
  (1, E2, E3, E4)
- *the TEXT file* generate the numbers reported in section 7
  (simulation study) based on the simulation reuslts
- *the SLURM files* run the BATCH files on a computer cluster in parallel.
- *the BUILD file* gather the results of the various simulations by
  reading the data in the =Results= directory. It converts them into a
  a single table (=data.table= format) and exported in the
  =Results-built= directory, not uploaded on Github to save space but
  available upon request.


#+BEGIN_SRC R :exports both :results output :session *R* :cache no
library(DelayedGSD)
sessionInfo()
#+END_SRC

#+RESULTS:
#+begin_example
R version 4.1.2 (2021-11-01)
Platform: x86_64-pc-linux-gnu (64-bit)
Running under: Red Hat Enterprise Linux 8.9 (Ootpa)

Matrix products: default
BLAS:   /maps/direct/software/R/4.1.2/lib64/R/lib/libRblas.so
LAPACK: /maps/direct/software/R/4.1.2/lib64/R/lib/libRlapack.so

locale:
 [1] LC_CTYPE=en_US.UTF-8       LC_NUMERIC=C              
 [3] LC_TIME=en_US.UTF-8        LC_COLLATE=en_US.UTF-8    
 [5] LC_MONETARY=en_US.UTF-8    LC_MESSAGES=en_US.UTF-8   
 [7] LC_PAPER=en_US.UTF-8       LC_NAME=C                 
 [9] LC_ADDRESS=C               LC_TELEPHONE=C            
[11] LC_MEASUREMENT=en_US.UTF-8 LC_IDENTIFICATION=C       

attached base packages:
[1] stats     graphics  grDevices utils     datasets  methods   base     

other attached packages:
[1] mvtnorm_1.2-5    DelayedGSD_0.0.7

loaded via a namespace (and not attached):
 [1] BB_2019.10-1     xml2_1.3.6       magrittr_2.0.3   tidyselect_1.2.1
 [5] gt_0.10.1        munsell_0.5.1    lattice_0.20-45  xtable_1.8-4    
 [9] colorspace_2.1-0 r2rtf_1.1.1      R6_2.5.1         quadprog_1.5-8  
[13] rlang_1.1.3      fastmap_1.2.0    fansi_1.0.6      dplyr_1.1.4     
[17] grid_4.1.2       nlme_3.1-153     gtable_0.3.5     gsDesign_3.6.2  
[21] utf8_1.2.4       cli_3.6.2        htmltools_0.5.7  digest_0.6.34   
[25] tibble_3.2.1     lifecycle_1.0.4  purrr_0.3.5      tidyr_1.2.1     
[29] ggplot2_3.5.1    vctrs_0.6.5      glue_1.7.0       compiler_4.1.2  
[33] pillar_1.9.0     generics_0.1.3   scales_1.3.0     pkgconfig_2.0.3 
#+end_example
